app/controllers/sessions_controller.rb

INSERT INTO `users` (`created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `last_sign_in_at`, `last_sign_in_ip`, `name`, `oauth_expires_at`, `oauth_token`, `provider`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `sign_in_count`, `uid`, `updated_at`) VALUES ('2013-01-21 18:11:42', NULL, NULL, 'mesmarty@gmail.com', '$2a$10$kGhAI4RGPMuz5ACpcIKrvO6OPRBGYBaz1ZHzAUoo9CW/qzbkOY.dO', NULL, NULL, 'Bilal Ahmed', '2013-03-22 08:46:18', 'AAAAAQKgRFrYBAN2dyZCJhWNcd78gYeftT1BEdoE5fFoMd4UpDq83c5UI1RemRadBFd4cZCTONx9q2g95qHkWCnKYbY7ln9GWZCsLt35GwZDZD', 'facebook', NULL, NULL, NULL, 0, '521788071', '2013-01-21 18:11:42')
---
def create
  auth = request.env['rack.auth']
  unless @auth = Authorization.find_from_hash(auth)
    # Create a new user or add an auth to existing user, depending on
    # whether there is already a user signed in.
    @auth = Authorization.create_from_hash(auth, current_user)